[
  {
    "chiste": "¿Qué le dice un iPhone a otro iPhone? \"No me toques, ¡estoy cargando!\""
  },
  {
    "chiste": "¿Cuál es el colmo de un electricista? Tener malas conexiones."
  },
  {
    "chiste": "¿Qué le dice un cable USB a otro? \"¿Estás conectado a mí?\""
  },
  {
    "chiste": "¿Por qué el libro de matemáticas estaba triste? Porque tenía demasiados problemas."
  },
  {
    "chiste": "¿Qué le dijo el WiFi a la impresora? \"Eres el amor de mi vida, pero ya no puedo conectar contigo\"."
  },
  {
    "chiste": "¿Cuál es el animal que más sabe de tecnología? El ratón de computadora."
  },
  {
    "chiste": "¿Qué le dijo un átomo a otro? \"Creo que perdí un electrón.\" \"¿Estás seguro?\" \"¡Sí! ¡Estoy positivo!\""
  },
  {
    "chiste": "¿Cómo se llama el pez que sabe programar? Un cod-fish."
  },
  {
    "chiste": "¿Por qué el programador siempre está frío? Porque abre demasiadas ventanas."
  },
  {
    "chiste": "¿Qué le dice un navegador web a otro? \"¡Vaya, qué pestaña tan atractiva!\""
  },
  {
    "chiste": "¿Por qué los programadores odian el mar? Porque siempre tienen que estar navegando."
  },
  {
    "chiste": "¿Cuál es el postre favorito de un programador? ¡Cookies!"
  },
  {
    "chiste": "¿Por qué los programadores prefieren el invierno al verano? Porque el invierno tiene un cero más."
  },
  {
    "chiste": "¿Qué hace un programador cuando tiene frío? Se mete en la terminal."
  },
  {
    "chiste": "¿Qué es un terapeuta para un código con errores? Un debugger emocional."
  },
  {
    "chiste": "¿Cuál es el deporte favorito de los cables de internet? El WiFi-durismo."
  },
  {
    "chiste": "¿Por qué el programador nunca sale de casa? Porque tiene miedo de los bugs."
  },
  {
    "chiste": "¿Cómo se llama el pez que escribe código? Un piranha-gramador."
  },
  {
    "chiste": "¿Por qué el smartphone no quiere ir al gimnasio? Porque ya tiene muchos megapíxeles."
  },
  {
    "chiste": "¿Cuál es el café favorito de un programador? Java."
  },
  {
    "chiste": "¿Qué le dice un código HTML a otro? \"¡Me encanta tu estilo!\""
  },
  {
    "chiste": "¿Cuál es el colmo de un DJ? Que su novia le deje por otro que le pone más RAM."
  },
  {
    "chiste": "¿Por qué los programadores odian las playas? Porque tienen demasiado \"sandbox\"."
  },
  {
    "chiste": "¿Cómo se llama el pariente más famoso de un código mal escrito? Un bugabuelo."
  },
  {
    "chiste": "¿Cuál es el animal más tecno-dependiente? El mouse."
  },
  {
    "chiste": "¿Por qué los ordenadores son tan malos contando chistes? Porque siempre se les traba la lengua."
  },
  {
    "chiste": "¿Cuál es el animal más tecnológico? El ratón, porque siempre está conectado."
  },
  {
    "chiste": "¿Cómo llama un hacker a su hijo? Root Junior."
  },
  {
    "chiste": "¿Qué le dice un smartphone a otro en San Valentín? \"Eres la aplicación de mi vida\"."
  },
  {
    "chiste": "¿Por qué los discos duros no pueden jugar al fútbol? Porque siempre pierden la memoria."
  },
  {
    "chiste": "¿Qué tipo de araña vive en Internet? La red social."
  },
  {
    "chiste": "¿Cuál es el colmo de un programador? Que su novia le deje por otro que le ponga más bytes."
  },
  {
    "chiste": "¿Por qué los espejos nunca son buenos programadores? Porque siempre están reflejando."
  },
  {
    "chiste": "¿Qué le dice un bit al otro? \"¿Te duele algo?\" \"¡Sí, tengo un byte!\""
  },
  {
    "chiste": "¿Qué es un terabyte? Un animal muy grande."
  },
  {
    "chiste": "¿Cómo se llama el perro de un programador? \"Ladrón\", porque siempre está \"haciendo fetch\"."
  },
  {
    "chiste": "¿Por qué el programador nunca sale de casa? Porque siempre tiene miedo de salir de su zona de confort."
  },
  {
    "chiste": "¿Cuál es el colmo de un astronauta? Tener un sueño espacial."
  },
  {
    "chiste": "¿Qué hace un programador cuando tiene frío? Se mete en la nube."
  },
  {
    "chiste": "¿Qué es un pingüino en la cama? Un sistema operativo muy frío."
  },
  {
    "chiste": "¿Por qué el programador se puso gafas? Porque no podía C#."
  },
  {
    "chiste": "¿Cómo se llama el primo de un router? Un ruter."
  },
  {
    "chiste": "¿Cuál es el plato favorito de un programador? Fish & Chips & Bits."
  },
  {
    "chiste": "¿Qué le dice un GIF a un JPEG? \"¡Qué raro verte tan quieto!\""
  },
  {
    "chiste": "¿Qué le dice una impresora a otra impresora? \"¿Esa hoja es tuya o es una impresión mía?\""
  },
  {
    "chiste": "¿Cuál es la comida favorita de un programador? El \"spaghetti code\"."
  },
  {
    "chiste": "¿Por qué los ordenadores nunca se pierden? Porque siempre siguen el mapa de bits."
  },
  {
    "chiste": "¿Cuál es el colmo de un astronauta? Que le digan \"¡Estás en la luna!\""
  },
  {
    "chiste": "¿Cómo se dice \"te quiero\" en binario? 01010100 01100101 00100000 01000001 01101101 01101111."
  },
  {
    "chiste": "¿Cuál es el animal más tecnológico? El ratón, porque siempre está haciendo clic."
  },
  {
    "chiste": "¿Qué hace un informático cogiendo una lámpara? Hace una copia de seguridad."
  },
  {
    "chiste": "¿Cuál es el día favorito de un ordenador? El ciberlunes."
  },
  {
    "chiste": "¿Por qué los discos duros son tan amables? Porque almacenan toda la información sin juzgar."
  },
  {
    "chiste": "¿Qué le dice un chatbot a otro chatbot? \"¿Eres humano?\" \"No, ¿tú?\""
  },
  {
    "chiste": "¿Cuál es el coche favorito de un programador? El Bitcoche."
  },
  {
    "chiste": "¿Por qué los cables siempre están bien informados? Porque siempre están conectados a la red."
  },
  {
    "chiste": "¿Qué es lo que un átomo le dice a otro átomo? \"Te he perdido un electrón.\" \"¡¿Estás seguro?!\" \"¡Estoy positivo!\""
  },
  {
    "chiste": "¿Cuál es la fruta favorita de los programadores? El i-mango."
  },
  {
    "chiste": "¿Qué le dice un fotón a otro? \"¡Tengo una energía impresionante!\""
  },
  {
    "chiste": "¿Cómo se llama el robot más tímido? Progra-miedo."
  },
  {
    "chiste": "¿Qué le dice un número a otro número? \"No me toques, ¡soy impar!\""
  },
  {
    "chiste": "¿Cuál es el día favorito de un robot? El día del click."
  },
  {
    "chiste": "¿Cuál es el plato favorito de un programador? Los chips."
  },
  {
    "chiste": "¿Por qué el programador no salió con la impresora? Porque no era su tipo."
  },
  {
    "chiste": "¿Qué le dice un pixel a otro? \"¿Por qué estás tan píxeleado?\""
  },
  {
    "chiste": "¿Cuál es el lugar favorito de un programador en casa? El teclado."
  },
  {
    "chiste": "¿Qué le dice un procesador a otro? \"Eres muy rápido, pero yo soy más core.\""
  },
  {
    "chiste": "¿Por qué los espejos son malos en computación? Porque siempre devuelven lo mismo."
  },
  {
    "chiste": "¿Cuál es la bebida favorita de un programador? Java caliente."
  },
  {
    "chiste": "¿Qué le dice un servidor a otro? \"Eres el host con más capacidad.\""
  },
  {
    "chiste": "¿Por qué el libro de computación estaba triste? Porque tenía demasiados errores."
  },
  {
    "chiste": "¿Cómo se llama el tío más popular en una red social? \"Facebuqueras\"."
  },
  {
    "chiste": "¿Por qué el programador siempre está estresado? Porque tiene demasiados bugs en su vida."
  },
  {
    "chiste": "¿Cuál es el pájaro favorito de los programadores? El tweet."
  },
  {
    "chiste": "¿Qué le dice un emoticono a otro? \"¡Eres tan expresivo!\""
  },
  {
    "chiste": "¿Por qué los programadores son tan buenos escalando montañas? Porque tienen un buen algoritmo para subir."
  },
  {
    "chiste": "¿Cuál es el colmo de un programador vegetariano? Que su código tenga muchos \"bugs\"."
  },
  {
    "chiste": "¿Qué le dice un correo electrónico a otro? \"¡Mejor nos vemos en el adjunto!\""
  },
  {
    "chiste": "¿Por qué el programador nunca llega tarde? Porque siempre sigue la ruta más eficiente."
  },
  {
    "chiste": "¿Qué le dice un servidor a otro en Navidad? \"¡Felices accesos!\""
  },
  {
    "chiste": "¿Por qué los discos duros siempre son buenos consejeros? Porque siempre tienen mucha memoria."
  },
  {
    "chiste": "¿Cuál es la herramienta favorita de un programador jardinero? El shovel (pala)."
  },
  {
    "chiste": "¿Por qué el código se puso rojo? Porque tenía un error de sintaxis."
  },
  {
    "chiste": "¿Qué le dice un navegador web a otro en una cita? \"¡Me encanta navegar contigo!\""
  },
  {
    "chiste": "¿Por qué el programador siempre está feliz? Porque siempre está haciendo algo nuevo."
  },
  {
    "chiste": "¿Cuál es el programa favorito de los pájaros? \"Twitter\"."
  },
  {
    "chiste": "¿Qué le dice un procesador a otro cuando hace calor? \"¡Ayuda! ¡Me estoy sobrecalentando!\""
  },
  {
    "chiste": "¿Por qué el programador siempre lleva un paraguas? Por si llueve código."
  },
  {
    "chiste": "¿Cuál es el juego de mesa favorito de los programadores? \"Debugging\"."
  },
  {
    "chiste": "¿Por qué el móvil no tiene amigos? Porque siempre está en modo avión."
  },
  {
    "chiste": "¿Qué le dice un átomo a otro átomo? \"¡Me han robado un electrón!\" \"¿Estás seguro?\" \"¡Sí, estoy positivo!\""
  },
  {
    "chiste": "¿Por qué los programadores siempre están estresados? Porque tienen demasiadas líneas de código en la cabeza."
  },
  {
    "chiste": "¿Cuál es el sueño de un procesador? Tener muchos \"núcleos\"."
  },
  {
    "chiste": "¿Qué le dice un disco duro a otro? \"¿Te acuerdas de aquellos bits que compartimos?\""
  },
  {
    "chiste": "¿Por qué los robots no tienen amigos? Porque siempre están ocupados con sus tareas."
  },
  {
    "chiste": "¿Cuál es el plato favorito de un hacker? El \"hash\" brown."
  },
  {
    "chiste": "¿Qué le dice un disco duro a otro cuando se encuentra lento? \"¡Vamos, mueve esos bytes!\""
  },
  {
    "chiste": "¿Por qué el programador siempre lleva un pañuelo? Porque tiene un resfriado de código."
  },
  {
    "chiste": "¿Cuál es el juego favorito de los ordenadores? \"Hide and Seek\" (Esconder y buscar)."
  },
  {
    "chiste": "¿Por qué el ordenador fue al médico? Porque tenía virus."
  }
]
